%---------------输入电动机参数-----------
UN=220;PN=22;IaN=115;Nn=1500;
Ra=0.21;%输入电枢电阻
CePhiN=(UN-Ra*IaN)/Nn;%电动势计算常量CeΦn
CTPhiN=9.55*CePhiN;%电磁转矩常量CtΦn
Ia=0:IaN;%电枢电流范围0~IaN
%--------------机械特性------------------
n=UN/CePhiN-Ra/(CePhiN)*Ia;%计算转速
TN=CTPhiN*Ia;%计算电磁转矩
TNP=TN*10;%扩大十倍显示
%---------- ----画图---------------------
plot(Ia,n,'b.',Ia,TNP,'r.');%绘制机械特性曲线
xlabel('电枢电流{\itI}_a/A');
ylabel('转速{\itn}/(r/min)，电磁转矩{\itT}/(N.m)');
text(30,1500,'转速{\itn}');%标记转速曲线
text(50,500,'电磁转矩{\itT}(X10)');%标记转矩曲线